In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\azal\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
import numpy as np

## Data Frames

In [3]:
forum_users = {
    'User ID': np.array([1, 2, 3, 4, 5]),
    'Username':['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age': [18, 35, 25, 38, None],
    'Joined Date':pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15']),
    'Total Post': [150, 230, 80, 420, 310],
    'Reputation':[500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Post  Reputation
0        1     bogdan_s  18.0  2032-01-01         150         500
1        2   jane_smith  35.0  2032-02-15         230         720
2        3      alex123  25.0  2032-04-25          80         200
3        4        bob56  38.0  2032-06-21         420         940
4        5  mark_wilson   NaN  2032-09-15         310         500

In [4]:
df.shape

(5, 6)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Post',
       'Reputation'],
      dtype='object')

In [7]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Post', 'Reputation']

In [8]:
type(df.columns)

pandas.core.indexes.base.Index

In [9]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [10]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Post              int64
Reputation              int64
dtype: object

In [11]:
df.values

array([[1, 'bogdan_s', 18.0, Timestamp('2032-01-01 00:00:00'), 150, 500],
       [2, 'jane_smith', 35.0, Timestamp('2032-02-15 00:00:00'), 230,
        720],
       [3, 'alex123', 25.0, Timestamp('2032-04-25 00:00:00'), 80, 200],
       [4, 'bob56', 38.0, Timestamp('2032-06-21 00:00:00'), 420, 940],
       [5, 'mark_wilson', nan, Timestamp('2032-09-15 00:00:00'), 310,
        500]], dtype=object)

In [12]:
type(df.values)

numpy.ndarray

In [13]:
df.values[1, 1]

'jane_smith'

In [14]:
df.head(3)

   User ID    Username   Age Joined Date  Total Post  Reputation
0        1    bogdan_s  18.0  2032-01-01         150         500
1        2  jane_smith  35.0  2032-02-15         230         720
2        3     alex123  25.0  2032-04-25          80         200

In [15]:
df.tail(2)

   User ID     Username   Age Joined Date  Total Post  Reputation
3        4        bob56  38.0  2032-06-21         420         940
4        5  mark_wilson   NaN  2032-09-15         310         500

In [16]:
df.describe()

        User ID        Age          Joined Date  Total Post  Reputation
count  5.000000   4.000000                    5    5.000000    5.000000
mean   3.000000  29.000000  2032-04-28 00:00:00  238.000000  572.000000
min    1.000000  18.000000  2032-01-01 00:00:00   80.000000  200.000000
25%    2.000000  23.250000  2032-02-15 00:00:00  150.000000  500.000000
50%    3.000000  30.000000  2032-04-25 00:00:00  230.000000  500.000000
75%    4.000000  35.750000  2032-06-21 00:00:00  310.000000  720.000000
max    5.000000  38.000000  2032-09-15 00:00:00  420.000000  940.000000
std    1.581139   9.201449                  NaN  133.304163  276.622486

In [17]:
type(df.describe())

pandas.core.frame.DataFrame

In [18]:
df.describe().describe()

        User ID        Age  Total Post  Reputation
count  8.000000   8.000000    8.000000    8.000000
mean   3.072642  23.400181  195.788020  464.202811
std    1.510485  12.234283  132.058109  298.054406
min    1.000000   4.000000    5.000000    5.000000
25%    1.895285  15.800362  119.978123  257.466865
50%    3.000000  26.125000  190.000000  500.000000
75%    4.250000  31.437500  256.000000  609.000000
max    5.000000  38.000000  420.000000  940.000000

In [19]:
df.describe().describe().round(2)

       User ID    Age  Total Post  Reputation
count     8.00   8.00        8.00        8.00
mean      3.07  23.40      195.79      464.20
std       1.51  12.23      132.06      298.05
min       1.00   4.00        5.00        5.00
25%       1.90  15.80      119.98      257.47
50%       3.00  26.12      190.00      500.00
75%       4.25  31.44      256.00      609.00
max       5.00  38.00      420.00      940.00

In [20]:
df.select_dtypes(include='object')

      Username
0     bogdan_s
1   jane_smith
2      alex123
3        bob56
4  mark_wilson

In [21]:
df.select_dtypes(include='object')

      Username
0     bogdan_s
1   jane_smith
2      alex123
3        bob56
4  mark_wilson

In [22]:
df.select_dtypes(exclude=['object', 'int64'])

    Age Joined Date
0  18.0  2032-01-01
1  35.0  2032-02-15
2  25.0  2032-04-25
3  38.0  2032-06-21
4   NaN  2032-09-15

In [23]:
df.select_dtypes(include='int64')

   User ID  Total Post  Reputation
0        1         150         500
1        2         230         720
2        3          80         200
3        4         420         940
4        5         310         500

In [24]:
df.isna()

   User ID  Username    Age  Joined Date  Total Post  Reputation
0    False     False  False        False       False       False
1    False     False  False        False       False       False
2    False     False  False        False       False       False
3    False     False  False        False       False       False
4    False     False   True        False       False       False

In [25]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    0
Total Post     0
Reputation     0
dtype: int64

## Series

In [26]:
username_series = df['Username']
username_series

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [27]:
type(df['Username'])

pandas.core.series.Series

In [28]:
username_series.values

array(['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
      dtype=object)

In [29]:
type(username_series.values)

numpy.ndarray

In [30]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
df['Username'].value_counts()

Username
bogdan_s       1
jane_smith     1
alex123        1
bob56          1
mark_wilson    1
Name: count, dtype: int64

In [32]:
df['Username'].value_counts().index

Index(['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'], dtype='object', name='Username')

In [33]:
df['Reputation'].value_counts().index

Index([500, 720, 200, 940], dtype='int64', name='Reputation')

In [35]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [36]:
df['Reputation'].unique()

array([500, 720, 200, 940])

In [38]:
df['Username'].sort_values(ascending= False)

4    mark_wilson
1     jane_smith
0       bogdan_s
3          bob56
2        alex123
Name: Username, dtype: object

In [39]:
df['Username'].sort_values()

2        alex123
3          bob56
0       bogdan_s
1     jane_smith
4    mark_wilson
Name: Username, dtype: object